from db.sql.enums.enums import Lang

dictionary = {
    "1": {
        "ru": "Успешно продлено с автоматическим списанием!",
        "ua": "Успішно продовжено з автоматичним списанням!"
    },
    "2": {
        "ru": "Не удалось продлить подписку🙁. Регулярная подписка окончена, или отключена. Для покупки месячной подписки выберите оплату🤞",
        "ua": "Не вдалося продовжити підписку🙁. Регулярна підписка завершена або відключена. Для покупки місячної підписки виберіть оплату🤞"
    },
    "3": {
        "ru": "💥Подписка заканчивается через 7 дней!",
        "ua": "💥Підписка закінчується через 7 днів!"
    },
    "4": {
        "ru": "💥Подписка заканчивается через 3 дней!",
        "ua": "💥Підписка закінчується через 3 дні!"
    },
    "5": {
        "ru": "💥Подписка заканчивается через 1 дней!",
        "ua": "💥Підписка закінчується через 1 день!"
    },
    "6": {
        "ru": "💯 Мы удалили ваш регулярные платеж. 👊Подписка у вас, так и осталась, но теперь регулярно обновляться она не будет. 🤝После того как подписка закончится ми уведомим вас и вы новый способ оплати",
        "ua": "💯 Ми видалили ваш регулярний платіж. 👊Підписка у вас залишилась, але тепер регулярно оновлюватися вона не буде. 🤝Після завершення підписки ми повідомимо вас і ви зможете обрати новий спосіб оплати."
    },
    "7": {
        "ru": "У вас нет регулярного платежа!",
        "ua": "У вас немає регулярного платежу!"
    },
    "8": {
        "ru": "👊Подписка у вас, так и осталась, но теперь регулярно обновляться она не будет👋Теперь, вы можете выбрать новую систему, для продления подписки, или опять использовать wayforpay для авто снимания денег!",
        "ua": "👊Підписка у вас залишилась, але тепер регулярно оновлюватися вона не буде👋Тепер ви можете обрати нову систему для продовження підписки, або знову використовувати wayforpay для автоматичного списання грошей!"
    },
    "9": {
        "ru": "🤙На данный момент ви имеете подписку через wayforpay, где используются регулярные платежи каждый месяц! Если вы хотите оплатить новую регулярную подписку, или оплатить месяц подписки другим способом, то удалите текущий регулярный платеж👌",
        "ua": "🤙На даний момент ви маєте підписку через wayforpay, де використовуються регулярні платежі кожен місяць! Якщо ви хочете оплатити нову регулярну підписку, або оплатити місяць підписки іншим способом, то видаліть поточний регулярний платіж👌"
    },
    "10": {
        "ru": "Теперь осталось выбрать способ оплати",
        "ua": "Тепер залишилося обрати спосіб оплати"
    },
    "11": {
        "ru": "Выберите способ оплаты♠️",
        "ua": "Оберіть спосіб оплати♠️"
    },
    "12": {
        "ru": "Если у вас возникли проблемы, или вы хотите узнать более подробную информацию о проекте, нажмите на кнопку ниже👇",
        "ua": "Якщо у вас виникли проблеми або ви хочете дізнатися детальнішу інформацію про проєкт, натисніть на кнопку нижче👇"
    },
    "13": {
        "ru": '''Привет🫡

Здесь можно получить доступ в закрытый канал, где ты будешь получать эксклюзивные материалы, а именно:
🔸ежемесячные планы тренировок;
🔸статьи на темы разборов тренировок и питания с исследованиями, мыслями и цитатами из научных статей;
🔸стримы с ответами на вопросы участников канала;
🔸эксклюзивный контент от меня;

💵Цена подписки - всего 4$ в месяц!

🔥Минимум стоимости за максимум контента и пользы.
Жду тебя в комьюнити🦍
🤝Связь с поддержкой /support''',
        "ua": '''Привіт🫡

Тут можна отримати доступ до закритого каналу, де ти будеш отримувати ексклюзивні матеріали, а саме:
🔸щомісячні плани тренувань;
🔸статті на теми аналізу тренувань і харчування з дослідженнями, думками та цитатами з наукових статей;
🔸стріми з відповідями на запитання учасників каналу;
🔸ексклюзивний контент від мене;

💵Ціна підписки - усього 4$ на місяць.

🔥Мінімальна вартість за максимум контенту та користі.
Чекаю тебе у ком'юніті🦍
🤝Зв'язок з підтримкою /support'''
    },
    "14": {
        "ru": "🔊У вас установлено авто списание через wayforpay. Вы можете его отключить. Если отключить. Подписку вы не потеряете🤟, но через месяц автоматически она не продлится💫 \nи прийдется выбирать платежную систему для оплаты подписки на канал.",
        "ua": "🔊У вас встановлено авто списання через wayforpay. Ви можете його відключити. Якщо відключити, підписку ви не втратите🤟, але через місяць вона автоматично не продовжиться💫 \nі доведеться обирати платіжну систему для оплати підписки на канал."
    },
    "15": {
        "ru": "Выберите способ оплаты♠️",
        "ua": "Оберіть спосіб оплати♠️"
    },
    "16": {
        "ru": "Мы одобрили вашу заявку!!🎉",
        "ua": "Ми схвалили вашу заявку!!🎉"
    },
    "17": {
        "ru": "Мы НЕ одобрили вашу заявку!!☹️",
        "ua": "Ми НЕ схвалили вашу заявку!!☹️"
    },
    "18": {
        "ru": "❗️Платеж был создан: После того как оплатите подписку. Нажмите на 'Проверить оплату' и вам предоставится доступ к каналу",
        "ua": "❗️Платіж був створений: Після того, як оплатите підписку, натисніть 'Перевірити оплату', і вам надасться доступ до каналу"
    },
    "19": {
        "ru": "Теперь нужно оплатить подписку",
        "ua": "Тепер потрібно оплатити підписку"
    },
    "20": {
        "ru": "Вы успешно оплатили доступ🥳 Используя wayforpay, с регулярной подпиской!🙌",
        "ua": "Ви успішно оплатили доступ🥳 Використовуючи wayforpay, з регулярною підпискою!🙌"
    },
    "21": {
        "ru": "Вы еще не оплатили регулярный платеж!☹️ Если вы все же оплатили, то подождите 2 - 5 минут!",
        "ua": "Ви ще не оплатили регулярний платіж!☹️ Якщо ви все ж таки оплатили, зачекайте 2 - 5 хвилин!"
    },
    "22": {
        "ru": "Вы успешно оплатили!🥳",
        "ua": "Ви успішно оплатили!🥳"
    },
    "23": {
        "ru": "Вы еще не оплатили!☹️ Если вы все же оплатили, то подождите 2 - 5 минут!",
        "ua": "Ви ще не оплатили!☹️ Якщо ви все ж таки оплатили, зачекайте 2 - 5 хвилин!"
    },
    "24": {
        "ru": "Вы выбрали Coinpayments для оплаты подписки в USDT. Для этого оплатите, нажав кнопку 'Оплатить', после оплаты нажмите 'Проверить оплату'. Обратите внимание, что транзакция может занимать до 45 минут!",
        "ua": "Ви обрали Coinpayments для оплати підписки у USDT. Для цього оплатіть, натиснувши кнопку 'Оплатити', після оплати натисніть 'Перевірити оплату'. Зверніть увагу, що транзакция може займати до 45 хвилин!"
    },
    "25": {
        "ru": "Вы успешно оплатили через Coinpayment!🥳",
        "ua": "Ви успішно оплатили через Coinpayment!🥳"
    },
    "26": {
        "ru": "Coinpayment еще не подтвердил транзакцию или вы не оплатили!☹️ Если вы все же оплатили, то подождите немного до 45 минут, к тому времени все должно пройти успешно!",
        "ua": "Coinpayment ще не підтвердив транзакцію або ви не оплатили!☹️ Якщо ви все ж таки оплатили, зачекайте трохи до 45 хвилин, до того часу все повинно пройти успішно!"
    },
    "27": {
        "ru": "Пожалуйста выберете язык🌎",
        "ua": "Будь ласка, оберіть мову🌎"
    },
    "28": {
        "ru": "Вы точно в этом уверены!?",
        "ua": "Ви точно в цьому впевнені!?"
    },
    "29": {
        "ru": "Мы будем скучать! Удачи в тренировках🔩",
        "ua": "Ми будемо сумувати! Успіхів у тренуваннях🔩"
    },
    "30": {
        "ru": "Авто списывание через wayforpay было удаленно😌",
        "ua": "Автоматичне списання через wayforpay було видалено😌"
    },
    "31": {
        "ru": "Жаль, что ты нас покидаешь😢 Но мы всегда будем ждать тебя снова, успехов в тренировках🫡",
        "ua": "Шкода, що ти нас покидаєш😢 Але ми завжди будемо чекати тебе знову, успіхів у тренуваннях🫡"
    },
    "32": {
        "ru": "🔥Поздравляю, ты оформил подписку в Muscle Lab! Добро пожаловать в лучшее комьюнити натурального бодибилдинга🦍",
        "ua": "🔥Вітаю, ти оформив підписку в Muscle Lab! Ласкаво просимо до найкращого ком'юніті натурального бодібілдингу🦍"
    },
    "33": {
        "ru": "🔥Поздравляю, ты продлил подписку теперь тебе начислено еще месяц нахождения в лучшем канале для бодибилдинга💪",
        "ua": "🔥Вітаю, ти продовжив підписку, тепер тобі нараховано ще місяць перебуванняу найкращому каналі для бодібілдингу💪"
    },
    "34": {
        "ru": "Вот ваша ссылка на вступление👋",
        "ua": "Ось ваше посилання для вступу👋"
    },
    "35": {
        "ru": "Обратите внимание, что ссылка будет действительна в течении дня, после чего она станет недоступной, и вы не сможете вступить в канала. Не тяните время!👌",
        "ua": "Зверніть увагу, що посилання буде дійсне протягом дня, після чого стане недоступним, і ви не зможете вступити до каналу. Не гайте часу!👌"
    },
    "36": {
        "ru": "У Вас есть подписка до",
        "ua": "У Вас є підписка до"
    },
    "37": {
        "ru": "Для оформления подписки переведи *TON* на указанный адрес и ОБЯЗАТЕЛЬНО укажи комментарий (*memo*). Ты можешь оплатить подписку только на месяц вперёд.",
        "ua": "Для оформлення підписки переведіть *TON* на зазначену адресу і ОБОВ'ЯЗКОВО вкажіть коментар (*memo*). Ви можете оплатити підписку лише на місяць вперед."
    },
    "38": {
        "ru": "Стоимость подписки на *1 месяц = 0.7 TON*. P.s: чтобы скопировать *адрес и MEMO*, просто нажми на них.",
        "ua": "Вартість підписки на *1 місяць = 0.7 TON*. P.s: щоб скопіювати *адресу і MEMO*, просто натисніть на них."
    },
    "39": {
        "ru": "Вы админ этого канала!💪",
        "ua": "Ви адмін цього каналу!💪"
    },
    "40": {
        "ru": "💯 Мы удалили ваш регулярные платеж.",
        "ua": "💯 Ми видалили ваш регулярний платіж."
    },
    "41": {
        "ru": "Жаль, что ты нас покидаешь😢 \n Но мы всегда будем ждать тебя снова, успехов в тренировках🫡",
        "ua": "Шкода, що ти нас покидаєш 😢 \n Але ми завжди будемо чекати на тебе знову, успіхів у тренуваннях🫡"
    }
}
dic_inline = {
    "1": {
        "ru": "Отменить подписку сейчас🙄",
        "ua": "Скасувати підписку зараз🙄"
    },
    "2": {
        "ru": "Купить подписку на месяц сейчас🦾",
        "ua": "Купити підписку на місяць зараз🦾"
    },
    "3": {
        "ru": "Получить доступ в комьюнити🦾",
        "ua": "Отримати доступ до ком'юніті🦾"
    },
    "4": {
        "ru": "Связаться со мной",
        "ua": "Зв'язатися зі мною"
    },
    "5": {
        "ru": "Отменить подписку",
        "ua": "Скасувати підписку"
    },
    "6": {
        "ru": "Отменить авто списание через WFP",
        "ua": "Скасувати автоматичне списання через WFP"
    },
    "7": {
        "ru": "Оплатить 💳",
        "ua": "Оплатити 💳"
    },
    "8": {
        "ru": "Проверить оплату ⚡",
        "ua": "Перевірити оплату ⚡"
    },
    "9": {
        "ru": "Да",
        "ua": "Так"
    },
    "10": {
        "ru": "Нет",
        "ua": "Ні"
    }
}
dic_reply = {
    "1": {
        "ru": "Пополнить через TON 💳",
        "ua": "Поповнити через TON 💳"
    },
    "2": {
        "ru": "Пополнить через WayForPay 💎",
        "ua": "Поповнити через WayForPay 💎"
    },
    "3": {
        "ru": "Пополнить через USDT 💵",
        "ua": "Поповнити через USDT 💵"
    },
    "4": {
        "ru": "Удалить текущий регулярный платеж",
        "ua": "Видалити поточний регулярний платіж"
    },
    "5": {
        "ru": "Удалить текущий регулярный платеж и продлить подписку",
        "ua": "Видалити поточний регулярний платіж та продовжити підписку"
    },
}


def translate(index: str, lang: Lang) -> str:
    element = dictionary.get(index)
    code = lang.name.lower()
    return element.get(code)


def inline_translate(index: str, lang: Lang):
    element = dic_inline.get(index)
    code = lang.name.lower()
    return element.get(code)


def reply_translate(index: str, lang: Lang):
    element = dic_reply.get(index)
    code = lang.name.lower()
    return element.get(code)
